Revit 2027 API
BuiltInFailures.FaceSplitterFailures.InvalidClosedLoopsForFaceSplit Property
 The closed loop used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges. To split a face at its border, use an open loop that ends on the boundary of the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidClosedLoopsForFaceSplit { get; }
Public Shared ReadOnly Property InvalidClosedLoopsForFaceSplit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidClosedLoopsForFaceSplit {
	FailureDefinitionId^ get ();
}
static member InvalidClosedLoopsForFaceSplit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FaceSplitterFailures Class
Autodesk.Revit.DB Namespace